In [2]:
from pyspark.sql import SparkSession, Row

spark = SparkSession.builder.appName("RowExample").getOrCreate()

your 131072x1 screen size is bogus. expect trouble
25/08/20 13:57:32 WARN Utils: Your hostname, KLZPC0015 resolves to a loopback address: 127.0.1.1; using 172.25.17.96 instead (on interface eth0)
25/08/20 13:57:32 WARN Utils: Set SPARK_LOCAL_IP if you need to bind to another address
Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).
25/08/20 13:57:34 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable
25/08/20 13:57:37 WARN Utils: Service 'SparkUI' could not bind on port 4040. Attempting port 4041.
25/08/20 13:57:37 WARN Utils: Service 'SparkUI' could not bind on port 4041. Attempting port 4042.
25/08/20 13:57:37 WARN Utils: Service 'SparkUI' could not bind on port 4042. Attempting port 4043.

In [3]:
data = [
    (1, "Manta", 75000, "IT", 24),
    (2, "Dipankar", 30000, None, 27),
    (3, "Souvik", 60000, "Army Officer", 27),
    (4, "Soukarjya", 45000, "BDO", "null"),
    (5, "Arvind", 35000, "Business Data Analyst", 28),
    (6, "Prodipta", 25000, "Data Analyst", 28),
    (7, "Padma", 20000, "Data Analyst", 27),
    (8, "Panta", 125000, "Business Analyst", 27),
    (9, "Sougato", None, "Para Medical", 29)
]

In [4]:
df = spark.createDataFrame(data, ["id", "name", "salary", "department", "age"])
df.show(5)

+---+---------+------+--------------------+----+
| id|     name|salary|          department| age|
+---+---------+------+--------------------+----+
|  1|    Manta| 75000|                  IT|  24|
|  2| Dipankar| 30000|                NULL|  27|
|  3|   Souvik| 60000|        Army Officer|  27|
|  4|Soukarjya| 45000|                 BDO|null|
|  5|   Arvind| 35000|Business Data Ana...|  28|
+---+---------+------+--------------------+----+
only showing top 5 rows

In [4]:
print("Removing rows where any column has NULL values: ")
df_dropna_any = df.dropna()
df_dropna_any.show()

Removing rows where any column has NULL values:

+---+---------+------+--------------------+----+
| id|     name|salary|          department| age|
+---+---------+------+--------------------+----+
|  1|    Manta| 75000|                  IT|  24|
|  3|   Souvik| 60000|        Army Officer|  27|
|  4|Soukarjya| 45000|                 BDO|null|
|  5|   Arvind| 35000|Business Data Ana...|  28|
|  6| Prodipta| 25000|        Data Analyst|  28|
|  7|    Padma| 20000|        Data Analyst|  27|
|  8|    Panta|125000|    Business Analyst|  27|
+---+---------+------+--------------------+----+

In [5]:
print("Removing rows where all values are NULL: ")
df_dropna_all = df.dropna(how="all")
df_dropna_all.show()

Removing rows where all values are NULL:

+---+---------+------+--------------------+----+
| id|     name|salary|          department| age|
+---+---------+------+--------------------+----+
|  1|    Manta| 75000|                  IT|  24|
|  2| Dipankar| 30000|                NULL|  27|
|  3|   Souvik| 60000|        Army Officer|  27|
|  4|Soukarjya| 45000|                 BDO|null|
|  5|   Arvind| 35000|Business Data Ana...|  28|
|  6| Prodipta| 25000|        Data Analyst|  28|
|  7|    Padma| 20000|        Data Analyst|  27|
|  8|    Panta|125000|    Business Analyst|  27|
|  9|  Sougato|  NULL|        Para Medical|  29|
+---+---------+------+--------------------+----+

In [6]:
print("Removing rows where 'name' or 'salary' is NULL: ")
df_dropna_subset = df.dropna(subset=["name", "salary"])
df_dropna_subset.show()

Removing rows where 'name' or 'salary' is NULL:

+---+---------+------+--------------------+----+
| id|     name|salary|          department| age|
+---+---------+------+--------------------+----+
|  1|    Manta| 75000|                  IT|  24|
|  2| Dipankar| 30000|                NULL|  27|
|  3|   Souvik| 60000|        Army Officer|  27|
|  4|Soukarjya| 45000|                 BDO|null|
|  5|   Arvind| 35000|Business Data Ana...|  28|
|  6| Prodipta| 25000|        Data Analyst|  28|
|  7|    Padma| 20000|        Data Analyst|  27|
|  8|    Panta|125000|    Business Analyst|  27|
+---+---------+------+--------------------+----+